0xc0170/kinetis_kxx_gcc/gpio_demo_twrk20d72/cpu/startup_k20.c
/*
 * File: startup_k20.c
 *
 * Copyright (c) 2013, 0xc0170
 *
 * This program is free software. It comes without any warranty, to
 * the extent permitted by applicable law. You can redistribute it
 * and/or modify it under the terms of the Do What The Fuck You Want
 * To Public License, Version 2, as published by Sam Hocevar. See
 * http://www.wtfpl.net/ for more details.
 *
 */

extern unsigned long _etext;
extern unsigned long _sdata;
extern unsigned long _edata;
extern unsigned long _sbss;
extern unsigned long _ebss;

#if defined (__cplusplus)
extern "C" {
#endif

extern int main(void);
extern void __StackTop(void);

void Reset_Handler(void);
__attribute__ ((weak)) void NMI_Handler(void);
__attribute__ ((weak)) void HardFault_Handler(void);
__attribute__ ((weak)) void MemManage_Handler(void);
__attribute__ ((weak)) void BusFault_Handler(void);
__attribute__ ((weak)) void UsageFault_Handler(void);
__attribute__ ((weak)) void SVC_Handler(void);
__attribute__ ((weak)) void DebugMonitor_Handler(void);
__attribute__ ((weak)) void PendSV_Handler(void);
__attribute__ ((weak)) void SysTick_Handler(void);
__attribute__ ((weak)) void Default_Handler(void);

void DMA0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA2_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA3_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA4_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA5_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA6_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA7_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA8_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA9_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA10_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA11_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA12_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA13_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA14_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA15_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DMA_Error_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void MCM_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void FTFL_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void Read_Collision_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void LVD_LVW_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void LLW_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void Watchdog_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void RNG_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void I2C0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void I2C1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void SPI0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void SPI1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void SPI2_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_ORed_Message_buffer_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_Bus_Off_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_Error_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_Tx_Warning_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_Rx_Warning_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN0_Wake_Up_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_ORed_Message_buffer_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_Bus_Off_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_Error_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_Tx_Warning_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_Rx_Warning_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CAN1_Wake_Up_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART0_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART0_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART1_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART1_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART2_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART2_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART3_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART3_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART4_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART4_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART5_RX_TX_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void UART5_ERR_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ADC0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ADC1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CMP0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CMP1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CMP2_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void FTM0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void FTM1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void FTM2_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void CMT_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void RTC_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PIT0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PIT1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PIT2_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PIT3_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PDB0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void USB0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void USB_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ENET_1588_Timer_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ENET_Transmit_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ENET_Receive_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void ENET_Error_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void I2S0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void SDHC_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DAC0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void DAC1_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void TSI0_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void MCG_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void LPTimer_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PORTA_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PORTB_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PORTC_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PORTD_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void PORTE_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));
void Software_IRQHandler(void) __attribute__ ((weak, alias ("Default_Handler")));

